<!DOCTYPE html>
<html>
<body>

<?php
$students = [
    ["นาย", "จุฬาลักษณ์", "คงจรูญ", "609"],
    ["นาย", "ไตรคูน", "บุญนํา", "609"],
    ["นาย", "วรนาศักดิ์", "เกียรติพิเชฐชื่น", "609"],
    ["นาย", "นนทวัฒน์", "ขําดวง", "609"],
    ["นาย", "ภาณุพงศ์", "สายศร", "609"],
    ["นาย", "ปณณกร", "พวงสุวรรณ์", "609"],
    ["นาย", "วิศรุต", "กลิ่นเรือง", "609"],
    ["นาย", "อมรเทพ", "อันโน", "609"],
    ["นาย", "จักรกริช", "เทศทอง", "609"],
    ["นาย", "จิรฐา", "น้อยศรี", "609"],
    ["นาย", "กรพิพัฒน์", "เล็กนาก", "609"],
    ["นาย", "ภัทรพล", "ชมพุฒ", "609"],
    ["นาย", "ศุภชัย", "รุ่งแสง", "609"],
    ["นาย", "ณัฐพล", "ปลื้มกิจมงคล", "609"],
    ["นาย", "พลัษฎฐ์", "ด่านอนันต์สุข", "609"],
    ["นาย", "เรืองวิทย์", "โชคชัย", "609"],
    ["นาย", "จิรายุธ", "บูรณะจันทร์", "609"],
    ["น.ส.", "ณัชชา", "คำภา", "609"],
    ["น.ส.", "สาวิตรี", "มินสะมัน", "609"],
    ["น.ส.", "บัณพร", "ศิริพันธ์", "609"],
    ["น.ส.", "ญาณิศา", "พ่วงพี", "609"],
    ["น.ส.", "กิตญาดา", "จิตรวิมลรัตน์", "609"],
    ["น.ส.", "สุดารัตน์", "สวนยิ้ม", "609"],
    ["น.ส.", "พลอยประภัส", "พิษรักษ์", "609"],
    ["น.ส.", "ทัศชนก", "สมัย", "609"],
    ["น.ส.", "แพรพิไล", "บุญครอง", "609"],
    ["น.ส.", "กัลยภรณ์", "สิทธิวงศ์", "609"],
    ["น.ส.", "กาญจน์เกล้า", "สิทโธ", "609"],
    ["น.ส.", "กฤติมา", "เกียรติอาภรณ์", "609"],
    ["น.ส.", "อภิษฎา", "วชิรศรีสุนทรา", "609"],
    ["น.ส.", "ศิริกานต์", "เบ้าตุ่น", "609"],
    ["น.ส.", "กัญญาวีย์", "อุดมสารี", "609"],
    ["น.ส.", "ณัฐริณีย์", "ฉิมเรือง", "609"],
    ["น.ส.", "พิชาภรณ์", "มีโชคสม", "609"],
    ["น.ส.", "กัลย์ณิศา", "รัตน์เรืองอุดม", "609"],
    ["น.ส.", "ชุดา", "สาริพันธ์", "609"],
    ["น.ส.", "กันตา", "ปิยะภัทรกุล", "609"],
    ["น.ส.", "นภัสพรพรหม", "ตันชรากรณ์", "609"],
    ["น.ส.", "กิ่งกาญจน์", "รวมพล", "609"],
    ["น.ส.", "วชิราญาณ์", "วชิระนาวิน", "609"]
];


$top = [$students[10]];
$before11 = array_slice($students, 0, 10); 
$after11 = array_slice($students, 11);

$students = array_merge($top, $before11, $after11);


echo "<table border='1' cellpadding='8' cellspacing='0'>";
echo "<tr>
        <th>ลำดับ</th>
        <th>คำนำหน้า</th>
        <th>ชื่อ</th>
        <th>นามสกุล</th>
        <th>ห้อง</th>
      </tr>";

foreach ($students as $index => $s) {
    echo "<tr>
            <td>" . ($index + 1) . "</td>
            <td>{$s[0]}</td>
            <td>{$s[1]}</td>
            <td>{$s[2]}</td>
            <td>{$s[3]}</td>
          </tr>";
}

echo "</table>";
?>


</body>
</html>